# Groupby

In [1]:
import pandas as pd
import numpy as np

In [3]:
data={"company":["Goog","Goog","Msft","Msft","Fb","Fb"],
     "person":["sam","charlie","amy","vanessa","carl","sarah"],
     "sales":[200,120,340,124,343,250]}
df=pd.DataFrame(data)

In [4]:
df

  company   person  sales
0    Goog      sam    200
1    Goog  charlie    120
2    Msft      amy    340
3    Msft  vanessa    124
4      Fb     carl    343
5      Fb    sarah    250

In [8]:
by_comp=df.groupby("company")
by_comp.max()

          person  sales
company
Fb         sarah    343
Goog         sam    200
Msft     vanessa    340

In [9]:
by_comp.mean()

         sales
company
Fb       296.5
Goog     160.0
Msft     232.0

In [10]:
by_comp.min()

          person  sales
company
Fb          carl    250
Goog     charlie    120
Msft         amy    124

In [11]:
by_comp.sum()

         sales
company
Fb         593
Goog       320
Msft       464

In [12]:
by_comp.count()

         person  sales
company
Fb            2      2
Goog          2      2
Msft          2      2

In [13]:
by_comp.sum()["sales"]

company
Fb      593
Goog    320
Msft    464
Name: sales, dtype: int64